export type ErrorItem = {
  code: number | string;
  message: string;
};

export const errors: ErrorItem[] = [
  { code: 404, message: "این صفحه گم شده — بیا با هم دنبال یه ماجراجویی تازه بگردیم!" },
  { code: 500, message: "موتور سرور خسته شده — یه نفس می‌گیریم و دوباره امتحان می‌کنیم." },
  { code: 403, message: "متاسفم، این قسمت قفل شده — شاید یه رمز جادویی لازمه!" },
  { code: 400, message: "یه چیزی درست ارسال نشده — بیا یه بار دیگه سعی کنیم." },
  { code: 408, message: "منتظر زیادی موندیم — درخواست تایم‌اوت شد، دوباره تلاش کن." },
  { code: 429, message: "خیلی درخواست فرستادی — کمی استراحت کن و بعد دوباره امتحان کن." },
  { code: 401, message: "نیاز به ورود داری — بیا با هم وارد شیم!" },
  { code: "default", message: "اوه! یه پیچ‌خوردگی کوچک پیش اومده — نگران نباش، ما کمک می‌کنیم." }
];
